app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
	def index
		@article = Article.all

SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "articles" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Buah Pinah"], ["description", "Buah Pinag dibelah dua, dan blabalablabbala"], ["user_id", 1], ["created_at", "2016-06-12 03:10:47.929980"], ["updated_at", "2016-06-12 03:10:47.929980"]]
---
	def create
		# render plain: params[:article].inspect
		# @article = Article.new(article_params)
		# @article.save
		# redirect_to article_path(@article)
		# debugger
		@article = Article.new(article_params)
		@article.user = User.first
		if @article.save

UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Han Aku"], ["description", "Kurang jar anu ae, mbah tambah ae lagi"], ["updated_at", "2016-06-08 04:19:03.198052"], ["id", 3]]
---
	def update
		# @article = Article.find(params[:id])
		if @article.update(article_params)

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 3]]
---
	def destroy
		# @article = Article.find(params[:id])
		@article.destroy